""""Одиниці маси пронумеровані в такий спосіб:
1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 - центнер.
Дано номер одиниці маси (ціле число в діапазоні 1-5)
і маса тіла в цих одиницях (дійсне число). Знайти масу тіла
в кілограмах."""

import random

print("1 — кілограмм, 2 — мілліграмм, 3 — грамм, 4 — тонна, 5 — центнер")
i = random.randrange(1, 6)
M = random.randrange(1, 10000)
print("Номер одиниці маси: ", i)
print("Маса: ", M, end="")
if i == 1:
    print(" кг")
    m = M
elif i == 2:
    print(" мг")
    m = M / 1000000
elif i == 3:
    print(" г")
    m = M / 100
elif i == 4:
    print(" т")
    m = M * 1000
elif i == 5:
    print(" ц")
    m = M * 100
print("В кілограммах: ", m)